Revit 2024 API
DuctPressureDropData.VelocityPressure Property
 The velocity pressure of the duct. Units: (kg/(ft·s²)).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double VelocityPressure { get; set; }
Visual Basic
Public Property VelocityPressure As Double
	Get
	Set
Visual C++
public:
property double VelocityPressure {
	double get ();
	void set (double value);
}
See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace